# YOLOv8n-Ghost-2 (Ablation: 2 GhostConv layers)
# Backbone layers 5 (P4/16, 256→512) and 7 (P5/32, 512→1024) replaced with GhostConv.
# Two deepest downsampling layers; greater param/FLOPs reduction than Ghost-1.

nc: 80

scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv,      [64,   3, 2]]  # 0-P1/2  : standard
  - [-1, 1, Conv,      [128,  3, 2]]  # 1-P2/4  : standard
  - [-1, 3, C2f,       [128,  True]]  # 2
  - [-1, 1, Conv,      [256,  3, 2]]  # 3-P3/8  : standard
  - [-1, 6, C2f,       [256,  True]]  # 4
  - [-1, 1, GhostConv, [512,  3, 2]]  # 5-P4/16 : GHOST (layer 1 of 2)
  - [-1, 6, C2f,       [512,  True]]  # 6
  - [-1, 1, GhostConv, [1024, 3, 2]]  # 7-P5/32 : GHOST (layer 2 of 2)
  - [-1, 3, C2f,       [1024, True]]  # 8
  - [-1, 1, SPPF,      [1024, 5]]     # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]               # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]               # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]               # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]              # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]
