# YOLOv8n-Ghost
# Modification: backbone downsampling Conv (layers 1, 3, 5, 7) replaced with GhostConv
# to reduce parameters and FLOPs while maintaining detection accuracy.
#
# Motivation: Downsampling layers are computational bottlenecks; GhostConv generates
# feature maps via cheap linear transforms, cutting params ~50% per replaced layer.
#
# Layer 0 (Conv) kept as standard: first layer processes raw pixel input and benefits
# from full-precision spatial filtering.
# Neck Conv layers kept as standard: preserve multi-scale fusion stability.
#
# GhostConv is built into Ultralytics (ultralytics.nn.modules.conv.GhostConv).

nc: 80  # overridden at training time by --data yaml

scales:
  # [depth_multiple, width_multiple, max_channels]
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,      [64,   3, 2]]  # 0-P1/2  : standard (raw input, keep full conv)
  - [-1, 1, GhostConv, [128,  3, 2]]  # 1-P2/4  : ghost downsampling
  - [-1, 3, C2f,       [128,  True]]  # 2
  - [-1, 1, GhostConv, [256,  3, 2]]  # 3-P3/8  : ghost downsampling
  - [-1, 6, C2f,       [256,  True]]  # 4
  - [-1, 1, GhostConv, [512,  3, 2]]  # 5-P4/16 : ghost downsampling
  - [-1, 6, C2f,       [512,  True]]  # 6
  - [-1, 1, GhostConv, [1024, 3, 2]]  # 7-P5/32 : ghost downsampling
  - [-1, 3, C2f,       [1024, True]]  # 8
  - [-1, 1, SPPF,      [1024, 5]]     # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]         # cat backbone P4
  - [-1, 3, C2f, [512]]               # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]         # cat backbone P3
  - [-1, 3, C2f, [256]]               # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]        # cat head P4
  - [-1, 3, C2f, [512]]               # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]         # cat head P5
  - [-1, 3, C2f, [1024]]              # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]   # Detect(P3, P4, P5)
